{"genre---60s": 0, "genre---70s": 1, "genre---80s": 2, "genre---90s": 3, "genre---acidjazz": 4, "genre---african": 5, "genre---alternative": 6, "genre---alternativerock": 7, "genre---ambient": 8, "genre---atmospheric": 9, "genre---blues": 10, "genre---bluesrock": 11, "genre---bossanova": 12, "genre---breakbeat": 13, "genre---celtic": 14, "genre---chanson": 15, "genre---chillout": 16, "genre---choir": 17, "genre---classical": 18, "genre---classicrock": 19, "genre---club": 20, "genre---contemporary": 21, "genre---country": 22, "genre---dance": 23, "genre---darkambient": 24, "genre---darkwave": 25, "genre---deephouse": 26, "genre---disco": 27, "genre---downtempo": 28, "genre---drumnbass": 29, "genre---dub": 30, "genre---dubstep": 31, "genre---easylistening": 32, "genre---edm": 33, "genre---electronic": 34, "genre---electronica": 35, "genre---electropop": 36, "genre---ethnicrock": 37, "genre---ethno": 38, "genre---eurodance": 39, "genre---experimental": 40, "genre---folk": 41, "genre---funk": 42, "genre---fusion": 43, "genre---gothic": 44, "genre---groove": 45, "genre---grunge": 46, "genre---hard": 47, "genre---hardrock": 48, "genre---heavymetal": 49, "genre---hiphop": 50, "genre---house": 51, "genre---idm": 52, "genre---improvisation": 53, "genre---indie": 54, "genre---industrial": 55, "genre---instrumentalpop": 56, "genre---instrumentalrock": 57, "genre---jazz": 58, "genre---jazzfunk": 59, "genre---jazzfusion": 60, "genre---latin": 61, "genre---lounge": 62, "genre---medieval": 63, "genre---metal": 64, "genre---minimal": 65, "genre---newage": 66, "genre---newwave": 67, "genre---orchestral": 68, "genre---oriental": 69, "genre---pop": 70, "genre---popfolk": 71, "genre---poprock": 72, "genre---postrock": 73, "genre---progressive": 74, "genre---psychedelic": 75, "genre---punkrock": 76, "genre---rap": 77, "genre---reggae": 78, "genre---rnb": 79, "genre---rock": 80, "genre---rocknroll": 81, "genre---singersongwriter": 82, "genre---ska": 83, "genre---soul": 84, "genre---soundtrack": 85, "genre---swing": 86, "genre---symphonic": 87, "genre---synthpop": 88, "genre---techno": 89, "genre---trance": 90, "genre---tribal": 91, "genre---triphop": 92, "genre---world": 93, "genre---worldfusion": 94, "instrument---accordion": 95, "instrument---acousticbassguitar": 96, "instrument---acousticguitar": 97, "instrument---bass": 98, "instrument---beat": 99, "instrument---bell": 100, "instrument---bongo": 101, "instrument---brass": 102, "instrument---cello": 103, "instrument---clarinet": 104, "instrument---classicalguitar": 105, "instrument---computer": 106, "instrument---doublebass": 107, "instrument---drummachine": 108, "instrument---drums": 109, "instrument---electricguitar": 110, "instrument---electricpiano": 111, "instrument---flute": 112, "instrument---guitar": 113, "instrument---harmonica": 114, "instrument---harp": 115, "instrument---horn": 116, "instrument---keyboard": 117, "instrument---oboe": 118, "instrument---orchestra": 119, "instrument---organ": 120, "instrument---pad": 121, "instrument---percussion": 122, "instrument---piano": 123, "instrument---pipeorgan": 124, "instrument---rhodes": 125, "instrument---sampler": 126, "instrument---saxophone": 127, "instrument---strings": 128, "instrument---synthesizer": 129, "instrument---trombone": 130, "instrument---trumpet": 131, "instrument---ukulele": 132, "instrument---viola": 133, "instrument---violin": 134, "instrument---voice": 135, "mood/theme---action": 136, "mood/theme---adventure": 137, "mood/theme---advertising": 138, "mood/theme---ambiental": 139, "mood/theme---background": 140, "mood/theme---ballad": 141, "mood/theme---calm": 142, "mood/theme---children": 143, "mood/theme---christmas": 144, "mood/theme---commercial": 145, "mood/theme---cool": 146, "mood/theme---corporate": 147, "mood/theme---dark": 148, "mood/theme---deep": 149, "mood/theme---documentary": 150, "mood/theme---drama": 151, "mood/theme---dramatic": 152, "mood/theme---dream": 153, "mood/theme---emotional": 154, "mood/theme---energetic": 155, "mood/theme---epic": 156, "mood/theme---fast": 157, "mood/theme---film": 158, "mood/theme---fun": 159, "mood/theme---funny": 160, "mood/theme---game": 161, "mood/theme---groovy": 162, "mood/theme---happy": 163, "mood/theme---heavy": 164, "mood/theme---holiday": 165, "mood/theme---hopeful": 166, "mood/theme---horror": 167, "mood/theme---inspiring": 168, "mood/theme---love": 169, "mood/theme---meditative": 170, "mood/theme---melancholic": 171, "mood/theme---mellow": 172, "mood/theme---melodic": 173, "mood/theme---motivational": 174, "mood/theme---movie": 175, "mood/theme---nature": 176, "mood/theme---party": 177, "mood/theme---positive": 178, "mood/theme---powerful": 179, "mood/theme---relaxing": 180, "mood/theme---retro": 181, "mood/theme---romantic": 182, "mood/theme---sad": 183, "mood/theme---sexy": 184, "mood/theme---slow": 185, "mood/theme---soft": 186, "mood/theme---soundscape": 187, "mood/theme---space": 188, "mood/theme---sport": 189, "mood/theme---summer": 190, "mood/theme---trailer": 191, "mood/theme---travel": 192, "mood/theme---upbeat": 193, "mood/theme---uplifting": 194}